Samraksh/eMote/MicroFrameworkPK_v4_3/DeviceCode/Targets/Native/STM32F10x/DeviceCode/drivers/adc/hal_adc_driver.cpp
/*
 * hal_adc_driver.c
 *
 *  Created on: Sep 7, 2011
 *      Author: Sandip

 Would be cooler to use TIM3 trigger instead of CC
 Or use TIM1/TIM2 CC (already in use as main system timers).

 But all kinds of timing problems.
 Lots of cleanup could be done here after Nived's dual mode / continuous mode addition.
 --Nathan



 */

#include <tinyhal.h>
#include <stm32f10x.h>
#include "hal_adc_driver.h"
#include <Samraksh/Hal_util.h>
#include <Timer/advancedtimer/netmf_advancedtimer.h>
#include "../Include/Samraksh/VirtualTimer.h"

uint8_t EMOTE_ADC_CHANNEL[3] = {ADC_Channel_14, ADC_Channel_10, ADC_Channel_0};
uint32_t ADC_MODULE[3] = { ADC1_BASE, ADC2_BASE, ADC3_BASE};

void ADC_GPIO_Configuration(BOOL enable);
BOOL ADC_NVIC_Configuration(BOOL enable);
void ADC_RCC_Configuration(BOOL enable);
static double callbacksPerSecond = 0;

//TODO: Why do we use g_* when the variables are not extern?
HAL_CALLBACK_FPN g_callback = NULL;
static UINT64 g_timeStamp = 0;

UINT16 *g_adcUserBufferChannel1Ptr = NULL;
UINT16 *g_adcUserBufferChannel2Ptr = NULL;

UINT16 *g_adcDriverBufferChannel1Ptr = NULL;
//UINT16* g_adcDriverBufferChannel2Ptr = NULL; // TODO: Remove. Obsolete.

UINT32 *g_adcDriverBufferDualModePtr = NULL;

UINT32 adcNumSamples = 0;
UINT32 adcSamplingTime = 0;

static UINT32 adcPeriodicOnTimeUs = 1000;
static UINT32 adcPeriodicOffTimeUs = 1000;
static bool adcPeriodicOnTimeRunning = true;
// TODO: consolidate state machine into one variable.
BOOL batchModeADC = FALSE;
BOOL dmaModeInitialized = FALSE;
BOOL dualADCMode = FALSE;

#ifdef NATIVE_TEST
UINT16 g_adcDriverBufferChannel1[1000];
UINT32 g_adcDriverBufferDualMode[1000];
#endif

extern "C"
{
void ADC_HAL_HANDLER(void *param);
void DMA_HAL_HANDLER(void *param);
void TIM_HAL_HANDLER(void *param);
}

/**
 * interface for Microsoft.SPOT.Hardware.AnalogInput
 */
BOOL AD_Initialize( ANALOG_CHANNEL channel, INT32 precisionInBits )
{
	ADC_InitTypeDef           ADC_InitStructure;
	DMA_InitTypeDef           DMA_InitStructure;
	TIM_TimeBaseInitTypeDef   TIM_TimeBaseStructure;
	TIM_OCInitTypeDef         TIM_OCInitStructure;

	// Turn on the clocks for all the peripherals required
	ADC_RCC_Configuration(TRUE);

	// Enable the appropriate gpio pins
	ADC_GPIO_Configuration(TRUE);

	// Enable interrupts for dma/adc and tim
	// Note that adc and tim enables are for debugging purposes
	// The production code should only have dma
	if(!ADC_NVIC_Configuration(TRUE))
		return FALSE;

	/* ADC1 configuration ------------------------------------------------------*/
	ADC_InitStructure.ADC_Mode = ADC_Mode_Independent;
	ADC_InitStructure.ADC_ScanConvMode = ENABLE;
	ADC_InitStructure.ADC_ContinuousConvMode = DISABLE;
	ADC_InitStructure.ADC_ExternalTrigConv = ADC_ExternalTrigConv_None;
	ADC_InitStructure.ADC_DataAlign = ADC_DataAlign_Right;
	ADC_InitStructure.ADC_NbrOfChannel = 1;

	if(channel == 0)
		ADC_Init(ADC1, &ADC_InitStructure);
	else if(channel == 1)
		ADC_Init(ADC2, &ADC_InitStructure);
	else
		ADC_Init(ADC3, &ADC_InitStructure);

	  /* ADC1 regular channel10 configuration */
	if(channel == 0)
		ADC_RegularChannelConfig(ADC1, EMOTE_ADC_CHANNEL[0], 1, 0x04);
	else if(channel == 1)
		ADC_RegularChannelConfig(ADC2, EMOTE_ADC_CHANNEL[1], 1, 0x04);
	else
		ADC_RegularChannelConfig(ADC3, EMOTE_ADC_CHANNEL[2], 1, 0x04);

	  /* Enable ADC1 DMA */
	  //ADC_DMACmd(ADC1, ENABLE);

	  /* Enable ADC1 */
	if(channel == 0)
		ADC_Cmd(ADC1, ENABLE);
	else if(channel == 1)
		ADC_Cmd(ADC2, ENABLE);
	else
		ADC_Cmd(ADC3, ENABLE);

	  /* Enable ADC1 reset calibaration register */
	if(channel == 0)
		ADC_ResetCalibration(ADC1);
	else if(channel == 1)
		ADC_ResetCalibration(ADC2);
	else
		ADC_ResetCalibration(ADC3);

	  /* Check the end of ADC1 reset calibration register */
	if(channel == 0)
		while(ADC_GetResetCalibrationStatus(ADC1));
	else if(channel == 1)
		while(ADC_GetResetCalibrationStatus(ADC2));
	else
		while(ADC_GetResetCalibrationStatus(ADC3));

	  /* Start ADC1 calibaration */
	if(channel == 0)
		ADC_StartCalibration(ADC1);
	else if(channel == 1)
		ADC_StartCalibration(ADC2);
	else
		ADC_StartCalibration(ADC3);

	  /* Check the end of ADC1 calibration */
	if(channel == 0)
		while(ADC_GetCalibrationStatus(ADC1));
	else if(channel == 1)
		while(ADC_GetCalibrationStatus(ADC2));
	else
		while(ADC_GetCalibrationStatus(ADC3));

	callbacksPerSecond = 0;

	return TRUE;
}

void AD_Uninitialize( ANALOG_CHANNEL channel )
{
	if(channel == 0)
		ADC_Cmd(ADC1, DISABLE);
	else if(channel == 1)
		ADC_Cmd(ADC2, DISABLE);
	else
		ADC_Cmd(ADC3, DISABLE);
}

BOOL AD_Uninitialize(void)
{
	GLOBAL_LOCK(irq);

	TIM_Cmd(TIM4, DISABLE);

	ADC_DeInit(ADC1);

	dmaModeInitialized = FALSE;

	if(g_adcDriverBufferChannel1Ptr != NULL )
	{
		private_free(g_adcDriverBufferChannel1Ptr);
		g_adcDriverBufferChannel1Ptr = NULL;
	}

	ADC_GPIO_Configuration(FALSE);
	ADC_NVIC_Configuration(FALSE);
	ADC_RCC_Configuration(FALSE);

	DMA_DeInit(DMA1_Channel1);

	ADC_DMACmd(ADC1, DISABLE);
	ADC_DMACmd(ADC2, DISABLE);
	ADC_DMACmd(ADC3, DISABLE);

    ADC_ExternalTrigConvCmd(ADC1, DISABLE);
    ADC_ExternalTrigConvCmd(ADC2, DISABLE);
    ADC_ExternalTrigConvCmd(ADC3, DISABLE);

	ADC_Cmd(ADC1, DISABLE);
	ADC_Cmd(ADC2, DISABLE);
	ADC_Cmd(ADC3, DISABLE);
	

	return TRUE;
}

INT32 AD_Read( ANALOG_CHANNEL channel )
{

	ADC_SoftwareStartConvCmd(((ADC_TypeDef *) ADC_MODULE[channel]), ENABLE);

	for(UINT32 i=0;i<50;i++);

	return ADC_GetConversionValue((ADC_TypeDef *) ADC_MODULE[channel]);
}

UINT32 AD_ADChannels()
{
    return NUMBER_ADC_CHANNELS;
}

GPIO_PIN AD_GetPinForChannel( ANALOG_CHANNEL channel )
{
    return GPIO_PIN_NONE;
}

BOOL AD_GetAvailablePrecisionsForChannel( ANALOG_CHANNEL channel, INT32* precisions, UINT32& size )
{
    size = 0; return FALSE;
}


/**
 *  Turn on adc/dma and tim4 clocks
 *  @TODO: check for resource sharing before disable.
 */
void ADC_RCC_Configuration(BOOL enable)
{
	/* Enable peripheral clocks ------------------------------------------------*/
	/* Enable DMA1 clock */
	 RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1, (FunctionalState)enable);

	 RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM4, (FunctionalState)enable);

	/* Enable all possibly needed clocks */
	 RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA |
	                        RCC_APB2Periph_GPIOB |
	                        RCC_APB2Periph_GPIOC |
	                        RCC_APB2Periph_ADC1  |
	                        RCC_APB2Periph_ADC2,   (FunctionalState)enable);

