Samraksh/eMote/MicroFrameworkPK_v4_3/DeviceCode/Targets/Native/STM32F10x/DeviceCode/drivers/adc/hal_adc_driver.cpp
}

BOOL ADC_NVIC_Configuration(BOOL enable)
{
	BOOL retInit = TRUE;
	BOOL retCleanup = TRUE;
	if(enable == TRUE) {
		if((retInit &= CPU_INTC_ActivateInterrupt(DMA1_Channel1_IRQn, DMA_HAL_HANDLER, NULL)) != TRUE) {
			goto adc_nvic_cleanup_1;
		}
		if((retInit &= CPU_INTC_ActivateInterrupt(ADC1_2_IRQn,        ADC_HAL_HANDLER, NULL)) != TRUE) {
			goto adc_nvic_cleanup_2;
		}
		if((retInit &= CPU_INTC_ActivateInterrupt(TIM4_IRQn,          TIM_HAL_HANDLER, NULL)) != TRUE) {
			goto adc_nvic_cleanup_3;
		}
	}
	else { /* enable == FALSE */
adc_nvic_cleanup_3:
		retCleanup &= CPU_INTC_DeactivateInterrupt(TIM4_IRQn);
adc_nvic_cleanup_2:
		retCleanup &= CPU_INTC_DeactivateInterrupt(ADC1_2_IRQn);
adc_nvic_cleanup_1:
		retCleanup &= CPU_INTC_DeactivateInterrupt(DMA1_Channel1_IRQn);
	}
	BOOL retFinal = (retCleanup && retInit);
	return retFinal;
}

void ADC_GPIO_Configuration(BOOL enable)
{

// Note from Nathan: I don't think you actually have to toggle the pin...
// TODO cleanup, maybe use TIM3 instead (can use ADC_ExternalTrigConv_T3_TRGO) instead of CC

	GPIO_InitTypeDef GPIO_InitStructure;
	if(enable == TRUE)
	{
		// Output of TIM4 CH4 will trigger the adc conversion
		/* Configure TIM4_CH4 (PB9) as alternate function push-pull */
		// GPIO_InitStructure.GPIO_Pin = GPIO_Pin_9;
		// GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
		// GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
		// GPIO_Init(GPIOB, &GPIO_InitStructure); // Disabling to allow for GPIO output

		/* Configure PC.06 as output push-pull */
		// GPIO_InitStructure.GPIO_Pin = GPIO_Pin_6;
		// GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
		// GPIO_Init(GPIOC, &GPIO_InitStructure); // Disabling to allow for GPIO output

		/* Configure PC.01 and PC.04 (ADC Channel11 and Channel14) as analog input */
		GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0 | GPIO_Pin_1 | GPIO_Pin_4;
		GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AIN;
		//GPIO_Init(GPIOC, &GPIO_InitStructure);
		GPIO_ConfigurePin(GPIOC, GPIO_InitStructure.GPIO_Pin, GPIO_InitStructure.GPIO_Mode);
	}
	else /* enable == FALSE */
	{
		CPU_GPIO_DisablePin(GPIO_GetNumber(GPIOC, GPIO_Pin_0), RESISTOR_DISABLED, GPIO_Mode_IN_FLOATING, GPIO_ALT_PRIMARY);
		CPU_GPIO_DisablePin(GPIO_GetNumber(GPIOC, GPIO_Pin_1), RESISTOR_DISABLED, GPIO_Mode_IN_FLOATING, GPIO_ALT_PRIMARY);
		CPU_GPIO_DisablePin(GPIO_GetNumber(GPIOC, GPIO_Pin_4), RESISTOR_DISABLED, GPIO_Mode_IN_FLOATING, GPIO_ALT_PRIMARY);
	}
}

DeviceStatus AD_ConfigureContinuousMode(UINT16* sampleBuff1, UINT32 numSamples, UINT32 samplingTime, HAL_CALLBACK_FPN userCallback, void* Param)
{
	DeviceStatus retVal = DS_Success;
	UINT32 period;
	UINT32 prescaler = 1;

	callbacksPerSecond = ((double)numSamples * (double)samplingTime)/(double)1000000;

	// check if already initialized.
	if(dmaModeInitialized)
	{
		TIM_Cmd(TIM4, ENABLE);
		retVal = DS_Success;
		goto ad_ccm_out;
	}

	// Can not do anything with a null sample buffer
	if(!sampleBuff1)
	{
		retVal = DS_Fail;
	}

	// If number of samples is 0 there is nothing to do
	if(numSamples == 0)
	{
		retVal = DS_Fail;
	}

	// If the callback is null there is no point initializing the drivers and
	// running the adc as the users will never to get see the data
	if(!userCallback)
	{
		retVal = DS_Fail;
	}

	if(retVal == DS_Fail)
	{
		goto ad_ccm_out;
	}

	ADC_InitTypeDef           ADC_InitStructure;
	DMA_InitTypeDef           DMA_InitStructure;
	TIM_TimeBaseInitTypeDef   TIM_TimeBaseStructure;
	TIM_OCInitTypeDef         TIM_OCInitStructure;

	ADC_RCC_Configuration(TRUE);

	ADC_GPIO_Configuration(TRUE);

	if(!ADC_NVIC_Configuration(TRUE))
	{
		retVal = DS_Fail;
		goto ad_ccm_out_config;
	}

	g_callback = userCallback;

	if(Param != NULL)
	{
		Param = &g_timeStamp;
	}

	// Hold the user buffer
	g_adcUserBufferChannel1Ptr = sampleBuff1;

	RCC_ClocksTypeDef RCC_Clocks;
	RCC_GetClocksFreq(&RCC_Clocks);

	if (RCC_Clocks.HCLK_Frequency == RCC_Clocks.PCLK1_Frequency) {
		// No prescaler, so TIM clock == PCLK1
		period = samplingTime * (RCC_Clocks.PCLK1_Frequency/1000000);
	}
	else {
		// Prescaler, so TIM clock = PCLK1 x 2
		period = samplingTime * (RCC_Clocks.PCLK1_Frequency*2/1000000);
	}

	// Only have 16-bit timer
	// If sampling rate is too low, period will be too large.
	// So keep doubling the prescaler and halving the period.
	// Note that actual prescaler used in timer is prescaler+1, adjust at end.
	// TODO Add error check if sampling rate is too low.

	if (period > 0xFFFF) {
		period = period >> 1;
		prescaler = 2;
	}

	while (period > 0xFFFF) {
		prescaler = prescaler << 1;
		period = period >> 1;
	}

	// Adjust
	prescaler--;

	TIM_TimeBaseStructInit(&TIM_TimeBaseStructure);
    TIM_TimeBaseStructure.TIM_Period = (UINT16) period;
	TIM_TimeBaseStructure.TIM_Prescaler = (UINT16) prescaler;
	TIM_TimeBaseStructure.TIM_ClockDivision = 0;
	TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;
	TIM_TimeBaseInit(TIM4, &TIM_TimeBaseStructure);

	// Set up the compare channel
	TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_PWM1;
	TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
	TIM_OCInitStructure.TIM_Pulse = period-1;
	TIM_OCInitStructure.TIM_OCPolarity = TIM_OCPolarity_High;
    TIM_OC4Init(TIM4, &TIM_OCInitStructure);

	TIM_OC4PreloadConfig(TIM4, TIM_OCPreload_Enable);

    TIM_ARRPreloadConfig(TIM4, ENABLE);

#ifdef NATIVE_TEST
    g_adcDriverBufferChannel1Ptr = g_adcDriverBufferChannel1;
#else
	if(g_adcDriverBufferChannel1Ptr != NULL)
	{
		SOFT_BREAKPOINT();
		private_free(g_adcDriverBufferChannel1Ptr);
	}
	g_adcDriverBufferChannel1Ptr = (UINT16 *) private_malloc(sizeof(UINT16) * numSamples);
	if(g_adcDriverBufferChannel1Ptr == NULL)
	{
		ASSERT(0);
		retVal = DS_Fail;
		goto ad_ccm_out;
	}
#endif


    // Set up dma
    /* DMA1 channel1 configuration ----------------------------------------------*/
    DMA_DeInit(DMA1_Channel1);
    DMA_InitStructure.DMA_PeripheralBaseAddr = ADC1_DR_Address;
    DMA_InitStructure.DMA_MemoryBaseAddr = (UINT32)g_adcDriverBufferChannel1Ptr;
    DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralSRC;
    DMA_InitStructure.DMA_BufferSize = numSamples;
    DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
    DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
    DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_HalfWord;
    DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_HalfWord;
    DMA_InitStructure.DMA_Mode = DMA_Mode_Circular;
    DMA_InitStructure.DMA_Priority = DMA_Priority_High;
    DMA_InitStructure.DMA_M2M = DMA_M2M_Disable;
    DMA_Init(DMA1_Channel1, &DMA_InitStructure);

    DMA_ITConfig(DMA1_Channel1, DMA_IT_TC, ENABLE);

