Samraksh/eMote/MicroFrameworkPK_v4_3/DeviceCode/Targets/Native/STM32F10x/DeviceCode/drivers/adc/hal_adc_driver.cpp
    /* Enable DMA1 channel1 */
    DMA_Cmd(DMA1_Channel1, ENABLE);

    // Set up adc
    /* ADC1 configuration ------------------------------------------------------*/
    ADC_InitStructure.ADC_Mode = ADC_Mode_Independent;
    ADC_InitStructure.ADC_ScanConvMode = DISABLE;
    ADC_InitStructure.ADC_ContinuousConvMode = DISABLE;
    ADC_InitStructure.ADC_ExternalTrigConv = ADC_ExternalTrigConv_T4_CC4;
    ADC_InitStructure.ADC_DataAlign = ADC_DataAlign_Right;
    ADC_InitStructure.ADC_NbrOfChannel = 1;
    ADC_Init(ADC1, &ADC_InitStructure);

    /* ADC1 regular channel14 configuration */
    ADC_RegularChannelConfig(ADC1, ADC_Channel_14, 1, ADC_SampleTime_55Cycles5);

    /* Enable ADC1 DMA */
    ADC_DMACmd(ADC1, ENABLE);

    ADC_ExternalTrigConvCmd(ADC1, ENABLE);

    /* Enable ADC1 */
    //ADC_ITConfig(ADC1, ADC_IT_EOC, ENABLE);

    ADC_Cmd(ADC1, ENABLE);

    /* Enable ADC1 reset calibration register */
    ADC_ResetCalibration(ADC1);
    /* Check the end of ADC1 reset calibration register */
    while(ADC_GetResetCalibrationStatus(ADC1));	// FIXME: add timeout

    /* Start ADC1 calibration */
    ADC_StartCalibration(ADC1);
    /* Check the end of ADC1 calibration */
    while(ADC_GetCalibrationStatus(ADC1));	//FIXME: add timeout

    /* Start ADC1 Software Conversion */
    ADC_SoftwareStartConvCmd(ADC1, ENABLE);	//FIXME: add timeout


    TIM_Cmd(TIM4, ENABLE);

   	adcNumSamples = numSamples;
	adcSamplingTime = samplingTime;

	// Set DMA mode initialized to true
	// This is useful in batch mode scenarios where there is a lot of starting and stopping
	dmaModeInitialized = TRUE;

ad_ccm_out_config:
    if(retVal == DS_Fail)
    {
        ADC_NVIC_Configuration(FALSE);
        ADC_GPIO_Configuration(FALSE);
        ADC_RCC_Configuration(FALSE);
    }
ad_ccm_out:
	if(dmaModeInitialized && retVal == DS_Fail)
	{
		TIM_Cmd(TIM4, DISABLE);
	}
	if(g_adcDriverBufferChannel1Ptr != NULL && retVal == DS_Fail)
	{
		private_free(g_adcDriverBufferChannel1Ptr);
	}
	return retVal;
}

void AD_StopSampling()
{
	TIM_Cmd(TIM4, DISABLE);
	ADC_Cmd(ADC1, DISABLE);
	ADC_Cmd(ADC2, DISABLE);
	VirtTimer_Stop(VIRT_TIMER_ADC_PERIODIC);
}

double AD_GetCallbacksPerSecond()
{
	return callbacksPerSecond;
}

void ISR_ADC_PERIOD (void* Param)
{
	if (adcPeriodicOnTimeRunning == true){
		adcPeriodicOnTimeRunning = false;
		VirtTimer_Change(VIRT_TIMER_ADC_PERIODIC, 0, adcPeriodicOffTimeUs, TRUE, ADVTIMER_32BIT);
		TIM_Cmd(TIM4, DISABLE);
		ADC_Cmd(ADC1, DISABLE);
		ADC_Cmd(ADC2, DISABLE);
	} else {
		adcPeriodicOnTimeRunning = true;
		VirtTimer_Change(VIRT_TIMER_ADC_PERIODIC, 0, adcPeriodicOnTimeUs, TRUE, ADVTIMER_32BIT);
		ADC_Cmd(ADC1, ENABLE);
		ADC_Cmd(ADC2, ENABLE);
		TIM_Cmd(TIM4, ENABLE);
	}
	VirtTimer_Start(VIRT_TIMER_ADC_PERIODIC);
}

INT32 AD_SetPeriodicSamplingInterval(double secondsADCSamples, double secondsADCsleeps)
{
	if (secondsADCsleeps == 0){
		hal_printf("periodic sampling disabled\r\n");
		VirtTimer_Stop(VIRT_TIMER_ADC_PERIODIC);
	} else {
		adcPeriodicOnTimeUs = (UINT32)(secondsADCSamples * 1000000);
		adcPeriodicOffTimeUs = (UINT32)(secondsADCsleeps * 1000000);
		hal_printf("starting periodic sampling on: %d off: %d\r\n",adcPeriodicOnTimeUs,adcPeriodicOffTimeUs);
		if(VirtTimer_Change(VIRT_TIMER_ADC_PERIODIC, 0, adcPeriodicOnTimeUs, TRUE, ADVTIMER_32BIT) != TimerSupported)
		{
			if(VirtTimer_SetTimer(VIRT_TIMER_ADC_PERIODIC, 0, adcPeriodicOnTimeUs, TRUE, TRUE, ISR_ADC_PERIOD, ADVTIMER_32BIT) != TimerSupported)
			{
				ASSERT(FALSE);
			}
		}
		VirtTimer_Start(VIRT_TIMER_ADC_PERIODIC);
		adcPeriodicOnTimeRunning = true;
	}

	// callbacksPerSecond has to be adjusted based on the periodic sampling rate
	// TODO: not sure what to set callbacksPerSecond to be if we have secondsADCSamples over 1
	if (secondsADCSamples < 1) {
		callbacksPerSecond = (((double)adcNumSamples * (double)adcSamplingTime)/(double)1000000) * secondsADCSamples;
	} else {
		callbacksPerSecond = ((double)adcNumSamples * (double)adcSamplingTime)/(double)1000000;
	}
	

	return true;
}

DeviceStatus AD_ConfigureBatchMode(UINT16* sampleBuff1, UINT32 numSamples, UINT32 samplingTime, HAL_CALLBACK_FPN userCallback, void* Param)
{
	batchModeADC = TRUE;

	return AD_ConfigureContinuousMode(sampleBuff1, numSamples, samplingTime, userCallback, Param);
}


DeviceStatus AD_ConfigureBatchModeDualChannel(UINT16* sampleBuff1, UINT16* sampleBuff2, UINT32 numSamples, UINT32 samplingTime, HAL_CALLBACK_FPN userCallback, void* Param)
{
	batchModeADC = TRUE;

	return AD_ConfigureContinuousModeDualChannel(sampleBuff1, sampleBuff2, numSamples, samplingTime,userCallback, Param );
}

DeviceStatus AD_ConfigureContinuousModeDualChannel(UINT16* sampleBuff1, UINT16* sampleBuff2, UINT32 numSamples, UINT32  samplingTime, HAL_CALLBACK_FPN userCallback, void* Param)
{
	ADC_InitTypeDef           ADC_InitStructure;
	DMA_InitTypeDef           DMA_InitStructure;
	TIM_TimeBaseInitTypeDef   TIM_TimeBaseStructure;
	TIM_OCInitTypeDef         TIM_OCInitStructure;

	UINT32 period;
	UINT32 prescaler;

	callbacksPerSecond = ((double)numSamples * (double)samplingTime)/(double)1000000;

	ADC_RCC_Configuration(TRUE);

	ADC_GPIO_Configuration(TRUE);

	if(!ADC_NVIC_Configuration(TRUE))
		return DS_Fail;

	g_callback = userCallback;

	if(Param != NULL)
	{
		Param = &g_timeStamp;
	}

	g_adcUserBufferChannel1Ptr = sampleBuff1;
	g_adcUserBufferChannel2Ptr = sampleBuff2;

	RCC_ClocksTypeDef RCC_Clocks;
	RCC_GetClocksFreq(&RCC_Clocks);

	if (RCC_Clocks.HCLK_Frequency == RCC_Clocks.PCLK1_Frequency) {
		// No prescaler, so TIM clock == PCLK1
		period = samplingTime * (RCC_Clocks.PCLK1_Frequency/1000000);
	}
	else {
		// Prescaler, so TIM clock = PCLK1 x 2
		period = samplingTime * (RCC_Clocks.PCLK1_Frequency*2/1000000);
	}

	prescaler = 1;

	// Only have 16-bit timer
	// If sampling rate is too low, period will be too large.
	// So keep doubling the prescaler and halving the period.
	// Note that actual prescaler used in timer is prescaler+1, adjust at end.
	// TODO Add error check if sampling rate is too low.

